#!/usr/bin/python
def RSA():
    print('我是RSA')

def DES():
    print('我是DES')

def MD5():
    print('我是MD5')

def menu():
    print('**********************************')
    print('*******请选择加密方式**************')
    print('******* 1.RSA  *******************')
    print('******* 2.DES  *******************')
    print('******* 3.MD5  *******************')
    print('*******123外任意数字退出**********')
    print('**********************************')

def menu2():
    print('*************************************')
    print('*******请选择解密方式******************')
    print('******* 1.RSA解密  *******************')
    print('******* 2.DES解密  *******************')
    print('******* 3.MD5解密  *******************')
    print('*******123外任意数字退出***************')
    print('**************************************')
list=[1,2,3]
menu()
a=int(input())

while(a in list):
    if(a==1):
        RSA()
        menu2()
        break
    elif(a==2):
        DES()
        break
    elif(a==3):
        MD5()
        break
    else:
        print('sssssss')
        break
        